<?xml version="1.0"?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="input_tensor" type="Parameter" version="opset1">
			<data shape="1,1024,1024,3" element_type="u8" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f32" />
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1" />
			</rt_info>
			<output>
				<port id="0" precision="U8" names="Func/StatefulPartitionedCall/input/_0:0,input_tensor:0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1024</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="3635_input_port_0/value" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Convert_2958" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1024</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1024</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="input_tensor/Transpose([0 3 1 2])/value5989688699" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="3634" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1024</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="3635" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="3637_input_port_1/value" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="36" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="3637" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/map/TensorArrayV2Stack/TensorListStack:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/bn_Conv1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="40" size="3456" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_44740" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3496" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/bn_Conv1/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/bn_Conv1/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/Conv1_relu/Relu6:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="3624" size="1152" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise/depthwise/ReadVariableOp:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="data_add_4474344748" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4776" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="4904" size="2048" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="data_add_4475144756" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="6952" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/expanded_conv_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="7016" size="6144" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand/Conv2D/ReadVariableOp:0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_4475944764" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="13160" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="13544" size="3456" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise/depthwise/ReadVariableOp:0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="data_add_4476744772" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="17000" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="24, 96, 1, 1" offset="17384" size="9216" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project/Conv2D/ReadVariableOp:0">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_4477544780" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="26600" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_1_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="26696" size="13824" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand/Conv2D/ReadVariableOp:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_4478344788" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="40520" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="41096" size="5184" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise/depthwise/ReadVariableOp:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_4479144796" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="46280" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="24, 144, 1, 1" offset="46856" size="13824" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project/Conv2D/ReadVariableOp:0">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="data_add_4479944804" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="60680" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_2_add/add:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="60776" size="13824" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand/Conv2D/ReadVariableOp:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_4480744812" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="74600" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="75176" size="5184" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_depthwise/depthwise/ReadVariableOp:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_4481544820" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="80360" size="576" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 144, 1, 1" offset="80936" size="18432" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_project/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="data_add_4482344828" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="99368" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_3_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="99496" size="24576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_expand/Conv2D/ReadVariableOp:0">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_4483144836" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="124072" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="124840" size="6912" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_depthwise/depthwise/ReadVariableOp:0">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_4483944844" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="131752" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_depthwise_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_depthwise_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_depthwise_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_depthwise_relu/Relu6:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_project_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 192, 1, 1" offset="132520" size="24576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_project/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_project/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="data_add_4484744852" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="157096" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_project_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_project_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_4_add/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_5_expand_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="192, 32, 1, 1" offset="157224" size="24576" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_5_expand/Conv2D/ReadVariableOp:0">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_5_expand/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="data_add_4485544860" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="181800" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_5_expand_BN/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_5_expand_BN/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_5_expand_relu/Relu6" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_5_expand_relu/Relu6:0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_5_depthwise_BN/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 3, 3" offset="182568" size="6912" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_5_depthwise/depthwise/ReadVariableOp:0">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/ssd_mobile_net_v2_fpn_keras_feature_extractor/model/block_5_depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
